#include<iostream>

/******************************************************************************************

制作	沉迷学习无法自拔小组
组员	沈雨澄 孙浩然 杨李鑫昊 于跃 （按姓名拼音排序）

本程序为经典吃豆人游戏的再版，鉴于作者初学C++语言编程，有诸多错漏之处敬请大家批评指正
在我们全体组员的团结协作下，我们完成了这版游戏的制作和设计

主要学习/设计内容：
1）鬼的随机移动
2）键盘读取状态
3）坐标地图绘制
4）人物死亡复位
5）人物移动控制
6）游戏胜负判定

感谢老师和助教们的耐心指导和同学们的经验分享

******************************************************************************************/
using namespace std;

void how_to_play(void)
{
	cout << "*********************************************"
		<< "*********************************************" << endl;

	cout << "\n\t本游戏共有三关" << endl;
	cout << "\t玩家为红色吃豆人，其他均为鬼" << endl;
	cout << "\t玩家吃掉所有豆子后游戏关卡胜利" << endl;
	cout << "\t按 w(上) a(左) s(下) d(右) 进行方向控制，每次按键后会在最近的路口转弯\n"
		<< "\t玩家共有三条命" << endl;

	cout << "\n\tEnjoy Your Game!!\n\n" << endl;

	cout << "*********************************************"
		<< "*********************************************" << endl;
	system("Pause");
	system("cls");
}

void victory(void)
{
	cout << "*********************************************"
		<< "*********************************************" << endl;
	cout << "\n\tYou win!!!" << endl;
	cout << "\n\tYou win!!!" << endl;
	cout << "\n\tYou win!!!" << endl;
	cout << "*********************************************"
		<< "*********************************************" << endl;
	system("Pause");
	system("cls");
}

void introduce(void)
{
	cout << "*********************************************"
		<< "*********************************************" << endl;

	cout << "\n\t制作	沉迷学习无法自拔小组" << endl;
	cout << "\t组员	沈雨澄 孙浩然 杨李鑫昊 于跃 （按姓名拼音排序）" << endl;
	cout << "\t本程序为经典吃豆人游戏的再版，鉴于作者初学C++语言编程，有诸多错漏之处敬请大家批评指正\n"
		<< "\t在我们全体组员的团结协作下，我们完成了这版游戏的制作和设计" << endl;

	cout << "\n\t主要学习/设计内容：\n"
		<< "\t1）鬼的随机移动\n"
		<< "\t2）键盘读取状态\n"
		<< "\t3）坐标地图绘制\n"
		<< "\t4）人物死亡复位\n"
		<< "\t5）人物移动控制\n"
		<< "\t6）游戏胜负判定\n" << endl;

	cout << "\n\t感谢老师和助教们的耐心指导和同学们的经验分享\n" << endl;

	cout << "*********************************************"
		<< "*********************************************" << endl;

	cout << "请按任意键结束游戏" << endl;
}